#  +    对应代码：__add_()  加法
#  -    对应代码：__sub_()  减法
#  <,<=,==    对应代码：__It_(),__le__(),__eq__()  比较运算
#  >,>=,!=    对应代码：__gt_(),__ge__(),__ne__()  比较运算
#  *，/    对应代码：__mul_(),__truediv__()        乘法，非整除
#  %，//    对应代码：__mod_(),__floordiv__()        取余，整除
#  **   对应代码：__pow_()                      幂运算
#演示算数运算符
a=10
b=12
print(a.__add__(b))    # 结果与a+b一样，在函数时也可以采用此类对应代码的方式运算，其他运算一次类推，a需要打点调用内置方法
print("1+1=",1+1)
print("10/3=",10/3)  #余除，可以精确到小数位
print("10.3//3=",10.3//3)   #整除，结果为整数，但会根据公式位数到位数的整除
print("10%3=",10%3)     #取余  1
print("2**8=",2**8)    #次方运算，也是指数运算

#赋值运算
num = 20    #把右边的赋值到左边的变量
name,age,height = "张三",18,1.65   #同时给多个变量赋值，分别用逗号分开
print("姓名是",name,"年龄是",age,"身高是",height)
num1 = num2 = 10    #多个相等的变量表达
print(num1,num2)

#复合赋值运算
a=10
a +=20   #a= a+20
print("a=",a)