"""
0-10万提成：10%
10-20万：10万以内部分按10%+7.5%(10-20万部分提成)
20-40万：按10%+7.5%+5%(分别对应0-10-20-40万部分提成)
40-60万：按10%+7.5%+5%+3%(分别对应0-10-20-40-60万部分提成)
60-100万：按10%+7.5%+5%+3%+1.5%(分别对应0-10-20-40-60-100万部分提成)
100万以上：按10%+7.5%+5%+3%+1.5%+1%(分别对应0-10-20-40-60-100-100以上万部分提成)
金额以input输入计算
"""
i=int(input('请输入您的业绩金额'))
a=[1000000,600000,400000,200000,100000,0]
r=[0.01,0.015,0.03,0.05,0.075,0.1]
result=0
for x in range(0,6):
    if i>a[x]:                       # 只能用列表符号，因上面a是列表
        result += (i-a[x])*r[x]      # +=可以把超过每个档位对应的提成金额逐步累+起来计算
        i=a[x]                       # 计算档位内提成，如50，计算40万的
print(result)