# 景点出票系统
# 1.要求：根据淡旺季的月份和年龄，打印对应的票价
# 2.4-10月份为旺季，根据年龄判断价格，成人18-60岁60元，儿童<18岁半价，老人>60岁20元
# 3.淡季1、2、3、11、12月份成人40元，其他人20元

month = int(input("请输入月份【1-12】"))
age = int(input("请输入您的年龄"))
if 4 <= month <= 10:  # 判断旺季时间
    if 0 <= age <= 18:  # 判断儿童年龄
        print(f"您的年龄{age}，为儿童，票价为{60 / 2}元")
    elif 18 <= age < 60:
        print(f"您的年龄{age}，为成年，票价60元")
    elif 60 <= age <= 150:
        print(f"您的年龄是{age}，为老年人，票价20元")
    else:
        print("您的年龄输入有误，请重新输入")
elif 0 < month < 4 or 10 < month < 12:  # 淡季时间
    if 18 <= age <= 60:
        print(f"您的年龄是{age}，为成年人，现在是淡季，票价为40元")
    elif 60 <= age <= 150 or 0<age<18:
        print(f"您的年龄{age}，老年儿童淡季门票价格均为20元")
    else:
        print("您的年龄输入有误，请重新输入")
else:
    print("月份输入有误，请重新输入")
